***** Joining elements of a list of str
#+begin_src python :results output
liste = ["a", "b", "c"]
print("\n".join(liste))
#+end_src

#+RESULTS:
: a
: b
: c

***** getting the argument/index of an element
#+begin_src python :results output
liste = [1,2]
print( liste.index(1))
#+end_src

#+RESULTS:
: 0

